### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_private_dns_zone.acr-pen-data-dns-zone will be created
  + resource "azurerm_private_dns_zone" "acr-pen-data-dns-zone" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "germanywestcentral.data.privatelink.azurecr.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "faspo-poc-net-rg"

      + soa_record (known after apply)
    }

  # azurerm_private_dns_zone_virtual_network_link.acr-pen-data-dns-zone-vnet-link will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "acr-pen-data-dns-zone-vnet-link" {
      + id                    = (known after apply)
      + name                  = "faspo-poc-acr-pen-data-dns-zone-vnet-link"
      + private_dns_zone_name = "germanywestcentral.data.privatelink.azurecr.io"
      + registration_enabled  = false
      + resource_group_name   = "faspo-poc-net-rg"
      + virtual_network_id    = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-net-rg/providers/Microsoft.Network/virtualNetworks/faspo-poc-vnet"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
